# Lab | SQL Select

In [3]:
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="/Users/unoma/IRONHACK/ironhack_service_account_big_query.json"

from google.cloud import bigquery
# Instantiates a client for BigQuery Service
client = bigquery.Client()

import six
six.moves.reload_module(six)

## Challenge 1 - Who have published what at where

Write a SELECT query that joins various tables to figure out what titles each author has published at which publishers.

In [24]:
query= ('''SELECT a.au_id AS AUTHOR_ID, a.au_lname AS LAST_NAME, a.au_fname as FINAL_NAME, t.title AS TITLE, p.pub_name AS PUBLISHER
FROM publications.authors AS a
JOIN publications.titleauthor AS ta ON a.au_id = ta.au_id
JOIN publications.titles AS t ON t.title_id = ta.title_id
JOIN publications.publishers AS p ON p.pub_id = t.pub_id
ORDER BY AUTHOR_ID''')

In [25]:
query_job = client.query(query=query)
query_job.to_dataframe()

,AUTHOR_ID,LAST_NAME,FINAL_NAME,TITLE,PUBLISHER
0,172-32-1176,White,Johnson,Prolonged Data Deprivation: Four Case Studies,New Moon Books
1,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
2,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
3,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems
4,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
5,267-41-2394,O'Leary,Michael,"Sushi, Anyone?",Binnet & Hardley
6,274-80-9391,Straight,Dean,Straight Talk About Computers,Algodata Infosystems
7,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
8,427-17-2319,Dull,Ann,Secrets of Silicon Valley,Algodata Infosystems
9,472-27-2349,Gringlesby,Burt,"Sushi, Anyone?",Binnet & Hardley
10,486-29-1786,Locksley,Charlene,Emotional Security: A New Algorithm,New Moon Books
11,486-29-1786,Locksley,Charlene,Net Etiquette,Algodata Infosystems
12,648-92-1872,Blotchet-Halls,Reginald,Fifty Years in Buckingham Palace Kitchens,Binnet & Hardley
13,672-71-3249,Yokomoto,Akiko,"Sushi, Anyone?",Binnet & Hardley
14,712-45-1867,del Castillo,Innes,Silicon Valley Gastronomic Treats,Binnet & Hardley
15,722-51-5454,DeFrance,Michel,The Gourmet Microwave,Binnet & Hardley
16,724-80-9391,MacFeather,Stearns,Computer Phobic AND Non-Phobic Individuals: Be...,Binnet & Hardley
17,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
18,756-30-7391,Karsen,Livia,Computer Phobic AND Non-Phobic Individuals: Be...,Binnet & Hardley
19,807-91-6654,Panteley,Sylvia,"Onions, Leeks, and Garlic: Cooking Secrets of ...",Binnet & Hardley
20,846-92-7186,Hunter,Sheryl,Secrets of Silicon Valley,Algodata Infosystems
21,899-46-2035,Ringer,Anne,Is Anger the Enemy?,New Moon Books
22,899-46-2035,Ringer,Anne,The Gourmet Microwave,Binnet & Hardley
23,998-72-3567,Ringer,Albert,Is Anger the Enemy?,New Moon Books
24,998-72-3567,Ringer,Albert,Life Without Fear,New Moon Books

## Challenge 2 - Who Have Published How Many At Where?

Query how many titles each author has published at each publisher.

In [28]:
query= ('''SELECT a.au_id AS AUTHOR_ID, a.au_lname AS LAST_NAME, a.au_fname as FINAL_NAME, p.pub_name AS PUBLISHER, COUNT(t.title) AS TITLE_COUNT
FROM publications.authors as a
JOIN publications.titleauthor as ta ON a.au_id = ta.au_id
JOIN publications.titles as t ON t.title_id = ta.title_id
JOIN publications.publishers as p ON p.pub_id = t.pub_id
GROUP BY AUTHOR_ID, LAST_NAME, FINAL_NAME, PUBLISHER
ORDER BY TITLE_COUNT desc''')

In [29]:
query_job = client.query(query=query)
query_job.to_dataframe()

      AUTHOR_ID       LAST_NAME FINAL_NAME             PUBLISHER  TITLE_COUNT
0   998-72-3567          Ringer     Albert        New Moon Books            2
1   807-91-6654        Panteley     Sylvia      Binnet & Hardley            1
2   722-51-5454        DeFrance     Michel      Binnet & Hardley            1
3   712-45-1867    del Castillo      Innes      Binnet & Hardley            1
4   899-46-2035          Ringer       Anne        New Moon Books            1
5   899-46-2035          Ringer       Anne      Binnet & Hardley            1
6   172-32-1176           White    Johnson        New Moon Books            1
7   486-29-1786        Locksley   Charlene        New Moon Books            1
8   486-29-1786        Locksley   Charlene  Algodata Infosystems            1
9   846-92-7186          Hunter     Sheryl  Algodata Infosystems            1
10  427-17-2319            Dull        Ann  Algodata Infosystems            1
11  672-71-3249        Yokomoto      Akiko      Binnet & Hardley            1
12  756-30-7391          Karsen      Livia      Binnet & Hardley            1
13  274-80-9391        Straight       Dean  Algodata Infosystems            1
14  724-80-9391      MacFeather    Stearns      Binnet & Hardley            1
15  724-80-9391      MacFeather    Stearns  Algodata Infosystems            1
16  213-46-8915           Green   Marjorie  Algodata Infosystems            1
17  213-46-8915           Green   Marjorie        New Moon Books            1
18  238-95-7766          Carson     Cheryl  Algodata Infosystems            1
19  409-56-7008          Bennet    Abraham  Algodata Infosystems            1
20  267-41-2394         O'Leary    Michael  Algodata Infosystems            1
21  267-41-2394         O'Leary    Michael      Binnet & Hardley            1
22  472-27-2349      Gringlesby       Burt      Binnet & Hardley            1
23  648-92-1872  Blotchet-Halls   Reginald      Binnet & Hardley            1

## Challenge 3 - Best selling Authors Ranking

Who are the top 3 authors who have sold the highest number of titles? Write a query to find out.

In [42]:
query= ('''SELECT a.au_id AS AUTHOR_ID, a.au_lname AS LAST_NAME, a.au_fname AS FINAL_NAME, SUM(s.qty) AS TOTAL
FROM publications.authors AS a
JOIN publications.titleauthor AS ta ON a.au_id = ta.au_id
JOIN publications.titles AS t ON t.title_id = ta.title_id
JOIN publications.sales AS s ON s.title_id = t.title_id
GROUP BY AUTHOR_ID, LAST_NAME, FINAL_NAME
ORDER BY TOTAL DESC
LIMIT 3''')

In [43]:
query_job = client.query(query=query)
query_job.to_dataframe()

     AUTHOR_ID LAST_NAME FINAL_NAME TOTAL
0  899-46-2035    Ringer       Anne   148
1  998-72-3567    Ringer     Albert   133
2  846-92-7186    Hunter     Sheryl    50

## Challenge 4 - Best Selling Authors Ranking

Now modify your solution in Challenge 3 so that the output will display all 23 authors instead of the top 3. Note that the authors who have sold 0 titles should also appear in your output (ideally display 0 instead of NULL as the TOTAL). Also order your results based on TOTAL from high to low.

In [54]:
query= ('''SELECT a.au_id AS AUTHOR_ID, a.au_lname AS LAST_NAME, a.au_fname AS FINAL_NAME, IFNULL(SUM(s.qty),0) AS TOTAL
FROM publications.authors AS a
LEFT JOIN publications.titleauthor AS ta ON a.au_id = ta.au_id
LEFT JOIN publications.titles AS t ON t.title_id = ta.title_id
LEFT JOIN publications.sales AS s ON s.title_id = t.title_id
GROUP BY AUTHOR_ID, LAST_NAME, FINAL_NAME
ORDER BY TOTAL DESC''')

In [55]:
query_job = client.query(query=query)
query_job.to_dataframe()

      AUTHOR_ID       LAST_NAME   FINAL_NAME TOTAL
0   899-46-2035          Ringer         Anne   148
1   998-72-3567          Ringer       Albert   133
2   846-92-7186          Hunter       Sheryl    50
3   427-17-2319            Dull          Ann    50
4   213-46-8915           Green     Marjorie    50
5   724-80-9391      MacFeather      Stearns    45
6   267-41-2394         O'Leary      Michael    45
7   807-91-6654        Panteley       Sylvia    40
8   722-51-5454        DeFrance       Michel    40
9   238-95-7766          Carson       Cheryl    30
10  486-29-1786        Locksley     Charlene    25
11  672-71-3249        Yokomoto        Akiko    20
12  756-30-7391          Karsen        Livia    20
13  472-27-2349      Gringlesby         Burt    20
14  648-92-1872  Blotchet-Halls     Reginald    20
15  172-32-1176           White      Johnson    15
16  274-80-9391        Straight         Dean    15
17  409-56-7008          Bennet      Abraham    15
18  712-45-1867    del Castillo        Innes    10
19  527-72-3246          Greene  Morningstar     0
20  341-22-1782           Smith      Meander     0
21  724-08-9931        Stringer         Dirk     0
22  893-72-1158        McBadden      Heather     0

## Bonus Challenge - Most Profiting Authors

Who are the 3 most profiting authors and how much royalties each of them have received? Write a query to find out.

In [90]:
query= ('''SELECT a.au_id AS AUTHOR_ID, a.au_lname AS LAST_NAME, a.au_fname AS FINAL_NAME, 
IFNULL((t.advance * ta.royaltyper) + (t.royalty * ta.royaltyper * t.ytd_sales),0) AS PROFIT
FROM publications.authors AS a
JOIN publications.titleauthor AS ta ON a.au_id = ta.au_id
JOIN publications.titles AS t ON t.title_id = ta.title_id
GROUP BY author_id, last_name, final_name, profit
ORDER BY profit DESC
LIMIT 3''')

In [91]:
query_job = client.query(query=query)
query_job.to_dataframe()

     AUTHOR_ID       LAST_NAME FINAL_NAME      PROFIT
0  213-46-8915           Green   Marjorie  45945300.0
1  722-51-5454        DeFrance     Michel  41167800.0
2  648-92-1872  Blotchet-Halls   Reginald  21534400.0